docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE52-f_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m01.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m02.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m03.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m04.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m05.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m06.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h00m07.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h00m08.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h00m09.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h00m10.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 41 MB   3.7 MB/s
     data_sent......................: 93 kB   8.5 kB/s
     http_req_blocked...............: avg=186.14µs min=241ns   med=261ns    max=6.99ms   p(90)=531ns    p(95)=561ns   
     http_req_connecting............: avg=33.11µs  min=0s      med=0s       max=1.28ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=150.58ms min=16.13ms med=88.18ms  max=444.25ms p(90)=280.19ms p(95)=287.33ms
       { expected_response:true }...: avg=150.58ms min=16.13ms med=88.18ms  max=444.25ms p(90)=280.19ms p(95)=287.33ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=4.66ms   min=58.89µs med=402.11µs max=21.53ms  p(90)=9.86ms   p(95)=14.12ms 
     http_req_sending...............: avg=479.39µs min=30.67µs med=67.42µs  max=6.37ms   p(90)=1.17ms   p(95)=4.01ms  
     http_req_tls_handshaking.......: avg=108.71µs min=0s      med=0s       max=3.46ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=145.44ms min=14.91ms med=88.02ms  max=435.16ms p(90)=270.03ms p(95)=277.27ms
     http_reqs......................: 61      5.526166/s
     iteration_duration.............: avg=356.04ms min=85.91ms med=354.34ms max=527.8ms  p(90)=377.13ms p(95)=408.82ms
     iterations.....................: 30      2.717786/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m11.0s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m11.0s/24h0m0s  30/30 iters, 30 per VU